mediashare/app/models/post.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 17]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ывфвыфвыф"], ["created_at", "2019-01-06 17:20:02.799836"], ["updated_at", "2019-01-06 17:20:02.799836"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "ывфвыфвыф"], ["LIMIT", 1]]
---
  def all_tags=(names)
    self.tags = names.split(',').map do |name|
      Tag.where(name: name.strip).first_or_create!