mediashare/app/views/admin/categories/_form.html.erb

SELECT "categories".* FROM "categories" WHERE (id != '') ORDER BY "categories"."name" ASC
---
        <%= f.label :parent_id, :class => "sign-label"%>
        <%= f.collection_select :parent_id, Category.where("id != '#{@category.id}'").order(:name), :id, :name, { include_blank: true }, :class => "form-control"%>