mediashare/app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page], per_page: 2)
---
SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

  def get_category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]