mediashare/app/views/tags/show.html.erb


<% if @tag.posts.empty? %>
---
SELECT  1 AS one FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ? LIMIT ?  [["tag_id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 3]]