mediashare/app/views/posts/_form.html.erb

        <%= f.label :category_id, :class => "sign-label" %>
        <%= f.collection_select :category_id, Category.order(:name), :id, :name, { include_blank: true }, :class => "form-control"  %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC