mediashare/app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def get_category
    @category = Category.find(params[:id])