mediashare/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 10)

UPDATE "posts" SET "description" = ?, "image" = ?, "category_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "My First Public Article"], ["image", "testimg.jpeg"], ["category_id", 2], ["updated_at", "2019-01-06 13:38:49.278660"], ["id", 2]]
---
  def update
    if @post.update_attributes(post_params)

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "image", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdds"], ["description", "dsds"], ["created_at", "2019-01-06 12:17:15.530812"], ["updated_at", "2019-01-06 12:17:15.530812"], ["image", "testimg.jpeg"], ["category_id", 2]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def get_post
    @post = Post.find(params[:id])