mediashare/app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "Рикардо"], ["LIMIT", 1]]
---
  def show
    @tag = Tag.find_by(name: params[:id])